OdDAI.AggregationType.type(OdSharedPtr&lt;OdTypeCode&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets a new type code for the aggregation data type.
\param typeCode [in] A type code for the aggregation data type to be set.